In [5]:
##############
#K. David Roell CFPB 7/12/16
#Compiles a report of all quality and macro edit failures for HMDA LAR data
#
##############
import json
import os
import pandas as pd
import psycopg2

with open('edit_sql.json') as f:
    edit_sql = json.load(f)
    
#conn = psycopg2.connect("dbname=hmdamaster user=roellk") #connect and return connection
#cur = conn.cursor()#instantiate cursor object to use in SQL queries
#parameter format for local use #consider changing hmdamaster to roellk if db changes cause a fail
params = {
'dbname':'hmdamaster',
'user':'roellk',
'password':'',
'host':'localhost',

}

#connect_string = "dbname=%s user=%s host=%s password =%s" %(dbname, user, host, password) #set a string for connection to SQL
try:
    conn = psycopg2.connect(**params)
    cur = conn.cursor()
    print("i'm connected")

except psycopg2.Error as e: #if database connection results in an error print the following
    print("I am unable to connect to the database: ", e)


lar_tables = ['hmdalar2014', 'hmdalar2013']
#edit_list = [item for item in dir(SQL_text) if not item.startswith("__")]

FileNotFoundError: [Errno 2] No such file or directory: 'edit_sql.json'

In [ ]:
def edit_text(table='hmdalar2014', edit_sql=edit_sql[0]['text'], edit_name=edit_sql[0]['name'], additional_fields=[]):
    base_sql = """SELECT agency, COUNT(sequence) AS {edit_name} """.format(edit_name=edit_name)
    table_sql = "\nFROM {table}\n".format(table=table) 
    group_sql = """ GROUP BY agency"""

    add_fields = ''
    for field in additional_fields:
        base_sql = base_sql + ',' + field
        group_sql = group_sql + ', '+ field
    return_sql = base_sql + table_sql + edit_sql + group_sql + ';'
    print(return_sql)
    return return_sql

In [10]:
first = True
for edit in edit_sql:
    name, text = edit['name'], edit['text']
    print(name)
    try:
        cur.execute(edit_text(edit_sql=text, edit_name=name))        
        data_df = pd.DataFrame(cur.fetchall())
        col_names = [desc[0] for desc in cur.description]
        data_df.columns = col_names
        print(data_df, '\n')
        if first:
            quality_df = data_df.copy()
            first = False
        else:
            quality_df=quality_df.merge(data_df, how='outer', on='agency')
            print(quality_df)

    except:
        print('no dataz')

Q035 WHERE loan_type != '1' AND purchaser IN  ('1','3')
SELECT agency, COUNT(sequence) AS Q035
FROM hmdalar2014
WHERE loan_type != '1' AND purchaser IN  ('1','3') GROUP BY agency;
  agency  q035
0      9   199
1      3   446
2      1   408
3      7  1579
4      2   158
5      5   156
Q001 WHERE amount not like '%NA%' AND income not like '%NA%' AND amount::int >= 1000 AND (amount::int / income::int) < 5
SELECT agency, COUNT(sequence) AS Q001
FROM hmdalar2014
WHERE amount not like '%NA%' AND income not like '%NA%' AND amount::int >= 1000 AND (amount::int / income::int) < 5 GROUP BY agency;
  agency   q001
0      9  54243
1      3   4614
2      1   4514
3      7   9280
4      2   1667
5      5   1699
  agency  q035   q001
0      9   199  54243
1      3   446   4614
2      1   408   4514
3      7  1579   9280
4      2   158   1667
5      5   156   1699
Q002 WHERE property_type = '1' AND income NOT LIKE '%NA%' AND amount NOT LIKE '%NA%' AND income::INT >= 200 AND amount::INT >= 2000
SELECT agency, COUNT(sequence) AS Q002
FROM hmdalar2014
WHERE property_type = '1' AND income NOT LIKE '%NA%' AND amount NOT LIKE '%NA%' AND income::INT >= 200 AND amount::INT >= 2000 GROUP BY agency;
  agency  q002
0      9  9892
1      3   704
2      1   971
3      7   673
4      2   274
5      5   214
  agency  q035   q001  q002
0      9   199  54243  9892
1      3   446   4614   704
2      1   408   4514   971
3      7  1579   9280   673
4      2   158   1667   274
5      5   156   1699   214
Q003 WHERE loan_type = '2' AND property_type in ('1', '2') AND amount::INT > 626 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q003
FROM hmdalar2014
WHERE loan_type = '2' AND property_type in ('1', '2') AND amount::INT > 626 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  q003
0      3   114
1      9  1178
2      7  3107
3      1   139
4      2    72
5      5    13
  agency  q035   q001  q002  q003
0      9   199  54243  9892  1178
1      3   446   4614   704   114
2      1   408   4514   971   139
3      7  1579   9280   673  3107
4      2   158   1667   274    72
5      5   156   1699   214    13
Q004 WHERE loan_type = '3' AND property_type IN ('1', '2') AND amount::INT >= 1050 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q004
FROM hmdalar2014
WHERE loan_type = '3' AND property_type IN ('1', '2') AND amount::INT >= 1050 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  q004
0      9   192
1      3    48
2      7   487
3      1    57
4      2     7
  agency  q035   q001  q002  q003   q004
0      9   199  54243  9892  1178  192.0
1      3   446   4614   704   114   48.0
2      1   408   4514   971   139   57.0
3      7  1579   9280   673  3107  487.0
4      2   158   1667   274    72    7.0
5      5   156   1699   214    13    NaN
Q005 WHERE purchaser IN ('1', '2', '3', '4') AND property_type IN ('1', '2') AND amount::INT > 1203 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q005
FROM hmdalar2014
WHERE purchaser IN ('1', '2', '3', '4') AND property_type IN ('1', '2') AND amount::INT > 1203 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  q005
0      9    51
1      3     4
2      7    52
3      1     7
4      2     1
5      5     2
  agency  q035   q001  q002  q003   q004  q005
0      9   199  54243  9892  1178  192.0    51
1      3   446   4614   704   114   48.0     4
2      1   408   4514   971   139   57.0     7
3      7  1579   9280   673  3107  487.0    52
4      2   158   1667   274    72    7.0     1
5      5   156   1699   214    13    NaN     2
Q013 WHERE property_type = '3' AND amount::INT >= 100 AND amount::INT <= 10000 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q013
FROM hmdalar2014
WHERE property_type = '3' AND amount::INT >= 100 AND amount::INT <= 10000 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency   q013
0      3  12200
1      9  16326
2      1   6668
3      7   2294
4      2   3245
5      5   1303
  agency  q035   q001  q002  q003   q004  q005   q013
0      9   199  54243  9892  1178  192.0    51  16326
1      3   446   4614   704   114   48.0     4  12200
2      1   408   4514   971   139   57.0     7   6668
3      7  1579   9280   673  3107  487.0    52   2294
4      2   158   1667   274    72    7.0     1   3245
5      5   156   1699   214    13    NaN     2   1303
Q036 WHERE property_type = '2' AND amount::INT > 150 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q036
FROM hmdalar2014
WHERE property_type = '2' AND amount::INT > 150 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency   q036
0      9   5118
1      3   2384
2      7  15224
3      1    988
4      2    479
5      5   1454
  agency  q035   q001  q002  q003   q004  q005   q013   q036
0      9   199  54243  9892  1178  192.0    51  16326   5118
1      3   446   4614   704   114   48.0     4  12200   2384
2      1   408   4514   971   139   57.0     7   6668    988
3      7  1579   9280   673  3107  487.0    52   2294  15224
4      2   158   1667   274    72    7.0     1   3245    479
5      5   156   1699   214    13    NaN     2   1303   1454
Q037 WHERE lien = '2' AND amount::INT > 250 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q037
FROM hmdalar2014
WHERE lien = '2' AND amount::INT > 250 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  q037
0      9  2646
1      3  1459
2      1   542
3      7   330
4      2   365
5      5   502
  agency  q035   q001  q002  q003   q004  q005   q013   q036  q037
0      9   199  54243  9892  1178  192.0    51  16326   5118  2646
1      3   446   4614   704   114   48.0     4  12200   2384  1459
2      1   408   4514   971   139   57.0     7   6668    988   542
3      7  1579   9280   673  3107  487.0    52   2294  15224   330
4      2   158   1667   274    72    7.0     1   3245    479   365
5      5   156   1699   214    13    NaN     2   1303   1454   502
Q038 WHERE lien = '3' AND amount::INT > 100 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q038
FROM hmdalar2014
WHERE lien = '3' AND amount::INT > 100 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  q038
0      9   546
1      3   203
2      7    11
3      1    98
4      2    41
5      5    84
  agency  q035   q001  q002  q003   q004  q005   q013   q036  q037  q038
0      9   199  54243  9892  1178  192.0    51  16326   5118  2646   546
1      3   446   4614   704   114   48.0     4  12200   2384  1459   203
2      1   408   4514   971   139   57.0     7   6668    988   542    98
3      7  1579   9280   673  3107  487.0    52   2294  15224   330    11
4      2   158   1667   274    72    7.0     1   3245    479   365    41
5      5   156   1699   214    13    NaN     2   1303   1454   502    84
Q025 WHERE loan_purpose = '1' AND property_type = '1' AND amount::INT <=10 AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q025
FROM hmdalar2014
WHERE loan_purpose = '1' AND property_type = '1' AND amount::INT <=10 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency   q025
0      9   8302
1      3   3980
2      1   4152
3      7  23214
4      2   2123
5      5   1253
  agency  q035   q001  q002  q003   q004  q005   q013   q036  q037  q038  \
0      9   199  54243  9892  1178  192.0    51  16326   5118  2646   546
1      3   446   4614   704   114   48.0     4  12200   2384  1459   203
2      1   408   4514   971   139   57.0     7   6668    988   542    98
3      7  1579   9280   673  3107  487.0    52   2294  15224   330    11
4      2   158   1667   274    72    7.0     1   3245    479   365    41
5      5   156   1699   214    13    NaN     2   1303   1454   502    84

    q025
0   8302
1   3980
2   4152
3  23214
4   2123
5   1253
Q068 WHERE action IN ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity = '4' AND co_race1 = '7' AND co_sex = '4'
SELECT agency, COUNT(sequence) AS Q068
FROM hmdalar2014
WHERE action IN ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity = '4' AND co_race1 = '7' AND co_sex = '4' GROUP BY agency;
  agency  q068
0      3  2166
1      9  1068
2      1  1241
3      7  1205
4      2   361
5      5   510
  agency  q035   q001  q002  q003   q004  q005   q013   q036  q037  q038  \
0      9   199  54243  9892  1178  192.0    51  16326   5118  2646   546
1      3   446   4614   704   114   48.0     4  12200   2384  1459   203
2      1   408   4514   971   139   57.0     7   6668    988   542    98
3      7  1579   9280   673  3107  487.0    52   2294  15224   330    11
4      2   158   1667   274    72    7.0     1   3245    479   365    41
5      5   156   1699   214    13    NaN     2   1303   1454   502    84

    q025  q068
0   8302  1068
1   3980  2166
2   4152  1241
3  23214  1205
4   2123   361
5   1253   510
Q014 WHERE income::INT > 3000 AND income NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q014
FROM hmdalar2014
WHERE income::INT > 3000 AND income NOT LIKE '%NA%' GROUP BY agency;
  agency  q014
0      9  2400
1      3   333
2      7   375
3      1   297
4      2   116
5      5    53
  agency  q035   q001  q002  q003   q004  q005   q013   q036  q037  q038  \
0      9   199  54243  9892  1178  192.0    51  16326   5118  2646   546
1      3   446   4614   704   114   48.0     4  12200   2384  1459   203
2      1   408   4514   971   139   57.0     7   6668    988   542    98
3      7  1579   9280   673  3107  487.0    52   2294  15224   330    11
4      2   158   1667   274    72    7.0     1   3245    479   365    41
5      5   156   1699   214    13    NaN     2   1303   1454   502    84

    q025  q068  q014
0   8302  1068  2400
1   3980  2166   333
2   4152  1241   297
3  23214  1205   375
4   2123   361   116
5   1253   510    53
Q024 WHERE action = '1' AND (amount::INT / income::INT) >= 5 AND income::INT <= 9 AND income NOT LIKE '%NA%' AND amount NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q024
FROM hmdalar2014
WHERE action = '1' AND (amount::INT / income::INT) >= 5 AND income::INT <= 9 AND income NOT LIKE '%NA%' AND amount NOT LIKE '%NA%'  GROUP BY agency;
  agency  q024
0      9  2876
1      3   533
2      7  1519
3      1   160
4      2    98
5      5    82
  agency  q035   q001  q002  q003   q004  q005   q013   q036  q037  q038  \
0      9   199  54243  9892  1178  192.0    51  16326   5118  2646   546
1      3   446   4614   704   114   48.0     4  12200   2384  1459   203
2      1   408   4514   971   139   57.0     7   6668    988   542    98
3      7  1579   9280   673  3107  487.0    52   2294  15224   330    11
4      2   158   1667   274    72    7.0     1   3245    479   365    41
5      5   156   1699   214    13    NaN     2   1303   1454   502    84

    q025  q068  q014  q024
0   8302  1068  2400  2876
1   3980  2166   333   533
2   4152  1241   297   160
3  23214  1205   375  1519
4   2123   361   116    98
5   1253   510    53    82
Q027 WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND property_type IN ('1', '2') AND income LIKE '%NA'
SELECT agency, COUNT(sequence) AS Q027
FROM hmdalar2014
WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND property_type IN ('1', '2') AND income LIKE '%NA'  GROUP BY agency;
no dataz
Q067 WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity = '4' AND co_race1 = '7' AND co_sex = '4' AND income NOT LIKE '%NA%'
SELECT agency, COUNT(sequence) AS Q067
FROM hmdalar2014
WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity = '4' AND co_race1 = '7' AND co_sex = '4' AND income NOT LIKE '%NA%' GROUP BY agency;
  agency  q067
0      3    25
1      9     2
2      1    83
3      7     8
4      2     8
5      5   115
  agency  q035   q001  q002  q003   q004  q005   q013   q036  q037  q038  \
0      9   199  54243  9892  1178  192.0    51  16326   5118  2646   546
1      3   446   4614   704   114   48.0     4  12200   2384  1459   203
2      1   408   4514   971   139   57.0     7   6668    988   542    98
3      7  1579   9280   673  3107  487.0    52   2294  15224   330    11
4      2   158   1667   274    72    7.0     1   3245    479   365    41
5      5   156   1699   214    13    NaN     2   1303   1454   502    84

    q025  q068  q014  q024  q067
0   8302  1068  2400  2876     2
1   3980  2166   333   533    25
2   4152  1241   297   160    83
3  23214  1205   375  1519     8
4   2123   361   116    98     8
5   1253   510    53    82   115
Q032 WHERE action = '1' AND action_taken_date == application_received_date
SELECT agency, COUNT(sequence) AS Q032
FROM hmdalar2014
WHERE action = '1' AND action_taken_date == application_received_date GROUP BY agency;
no dataz

17

Q035 1
Q001 2
Q002 3
Q003 4
Q004 5
Q005 6
Q013 7
Q036 8
Q037 9
Q038 10
Q025 11
Q068 12
Q014 13
Q024 14
Q027 15
Q067 16
Q032 17